Ran Plan for dir: `terraform` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # google_compute_disk.extra_disk will be created
+ resource "google_compute_disk" "extra_disk" {
      + access_mode                    = (known after apply)
      + create_snapshot_before_destroy = false
      + creation_timestamp             = (known after apply)
      + disk_id                        = (known after apply)
      + effective_labels               = {
          + "goog-terraform-provisioned" = "true"
        }
      + enable_confidential_compute    = (known after apply)
      + id                             = (known after apply)
      + label_fingerprint              = (known after apply)
      + last_attach_timestamp          = (known after apply)
      + last_detach_timestamp          = (known after apply)
      + licenses                       = (known after apply)
      + name                           = "extra-disk"
      + physical_block_size_bytes      = (known after apply)
      + project                        = "tonal-benefit-462606-b8"
      + provisioned_iops               = (known after apply)
      + provisioned_throughput         = (known after apply)
      + self_link                      = (known after apply)
      + size                           = 50
      + source_disk_id                 = (known after apply)
      + source_image_id                = (known after apply)
      + source_instant_snapshot_id     = (known after apply)
      + source_snapshot_id             = (known after apply)
      + terraform_labels               = {
          + "goog-terraform-provisioned" = "true"
        }
      + type                           = "pd-ssd"
      + users                          = (known after apply)
      + zone                           = "asia-southeast1-a"

      + guest_os_features {
          + type = (known after apply)
        }
    }

  # google_compute_instance.rocky_vm will be created
+ resource "google_compute_instance" "rocky_vm" {
      + can_ip_forward       = false
      + cpu_platform         = (known after apply)
      + creation_timestamp   = (known after apply)
      + current_status       = (known after apply)
      + deletion_protection  = false
      + effective_labels     = {
          + "goog-terraform-provisioned" = "true"
        }
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + label_fingerprint    = (known after apply)
      + machine_type         = "e2-medium"
      + metadata             = {
          + "ssh-keys" = <<-EOT
                rocky:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQC2Y1Ka6dZileAGheNUzU637zqKTtmehlpzt8uUCBwMMOO25w/HpUrCKv84r0P1CCzTtMtMmqgzyNiRiE8IpNRzeeLBxAFnILCtgJOpa9U+vLdjT3/2x3JGouXtOwDui0XI28/MoKQ/7k+FSM1dJEKuBVF2o4JWIDyFiLzMs9lxE+GvfCwRAZP6E7tQPXruKWqu6ChOZSK5Iv/W19SeQhf7DF8ddGskjHEHwVScq0aRHK6v+0sibzJQpqlx8fnYHnuGw4WsRbeWzAj6VoSl33mOvZGP17APa/lgy0HIn05HO4wQLRBGk89z+i2HQ+pV6RiAzyEhevnXnnCNVPYJnhASIJh7a0mo6/TrJKVMHs8BGi97566oyHPAz6NZ+wFKQ78nEkxDnkZAyeGARm/3thawYMHJMAlQP0V6x70gW2SitTstxCq+p6P2JK17ys1qcSHSLFH+DmDwyzAJaPj7mJlcBrTztaNnWOs12zUuatAASPTBKRYKguV3REtzXwzonT6ScV+xJQaUPy6BC1FbwdtlgUjKX7EHLlzjLLv3rl2g4XlqH32b16/khZZDXxLkg4OOpCuAyj3tUjcJMBUWjB/bCbTbIOa55Y4EO8MFwJ+pUrdxHxLK/vTGu6bPu9XZ4Rl08l1Kc39TwsdZb4zdTuq7R4CiERcNoRlJ84atrL1GrQ== penumarthigeeta@example.com
            EOT
        }
      + metadata_fingerprint = (known after apply)
      + min_cpu_platform     = (known after apply)
      + name                 = "rocky-vm"
      + project              = "tonal-benefit-462606-b8"
      + self_link            = (known after apply)
      + tags                 = [
          + "rocky",
        ]
      + tags_fingerprint     = (known after apply)
      + terraform_labels     = {
          + "goog-terraform-provisioned" = "true"
        }
      + zone                 = "asia-southeast1-a"

      + attached_disk {
          + device_name                = "extra-disk"
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)
        }

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + guest_os_features          = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + architecture           = (known after apply)
              + image                  = "rocky-linux-cloud/rocky-linux-8"
              + labels                 = (known after apply)
              + provisioned_iops       = (known after apply)
              + provisioned_throughput = (known after apply)
              + resource_policies      = (known after apply)
              + size                   = 20
              + snapshot               = (known after apply)
              + type                   = (known after apply)
            }
        }

      + confidential_instance_config {
          + confidential_instance_type  = (known after apply)
          + enable_confidential_compute = (known after apply)
        }

      + guest_accelerator {
          + count = (known after apply)
          + type  = (known after apply)
        }

      + network_interface {
          + internal_ipv6_prefix_length = (known after apply)
          + ipv6_access_type            = (known after apply)
          + ipv6_address                = (known after apply)
          + name                        = (known after apply)
          + network                     = "default"
          + network_attachment          = (known after apply)
          + network_ip                  = (known after apply)
          + stack_type                  = (known after apply)
          + subnetwork                  = (known after apply)
          + subnetwork_project          = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }

      + reservation_affinity {
          + type = (known after apply)

          + specific_reservation {
              + key    = (known after apply)
              + values = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart           = (known after apply)
          + availability_domain         = (known after apply)
          + instance_termination_action = (known after apply)
          + min_node_cpus               = (known after apply)
          + on_host_maintenance         = (known after apply)
          + preemptible                 = (known after apply)
          + provisioning_model          = (known after apply)
          + termination_time            = (known after apply)

          + local_ssd_recovery_timeout {
              + nanos   = (known after apply)
              + seconds = (known after apply)
            }

          + max_run_duration {
              + nanos   = (known after apply)
              + seconds = (known after apply)
            }

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }

          + on_instance_stop_action {
              + discard_local_ssd = (known after apply)
            }
        }
    }

  # null_resource.generate_inventory will be created
+ resource "null_resource" "generate_inventory" {
      + id = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ instance_ip = (known after apply)

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform`
* :put_litter_in_its_place: To **delete** this plan click [here](http://7ad48a2332a4:4141/lock?id=GeetaSree13%252Fterraform_ansible%252Fterraform%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform`
</details>
Plan: 3 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
